In [15]:
import pandas as pd
import numpy as np

In [16]:
df = pd.read_csv("data3.csv")
df

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [17]:
df['Genre'] = pd.to_numeric(df['Genre'], errors='coerce')

In [18]:
df.mean()

CustomerID                100.50
Genre                        NaN
Age                        38.85
Annual Income (k$)         60.56
Spending Score (1-100)     50.20
dtype: float64

In [19]:
df.loc[:,'Age'].mean()

38.85

In [20]:
df.mean(axis=1)[0:4]

0    18.50
1    29.75
2    11.25
3    30.00
dtype: float64

In [21]:
df.median()

CustomerID                100.5
Genre                       NaN
Age                        36.0
Annual Income (k$)         61.5
Spending Score (1-100)     50.0
dtype: float64

In [22]:
df.loc[:,'Age'].median()

36.0

In [23]:
df.median(axis=1)[0:4]

0    17.0
1    18.0
2    11.0
3    19.5
dtype: float64

In [24]:
df.mode()

     CustomerID  Genre   Age  Annual Income (k$)  Spending Score (1-100)
0             1    NaN  32.0                54.0                    42.0
1             2    NaN   NaN                78.0                     NaN
2             3    NaN   NaN                 NaN                     NaN
3             4    NaN   NaN                 NaN                     NaN
4             5    NaN   NaN                 NaN                     NaN
..          ...    ...   ...                 ...                     ...
195         196    NaN   NaN                 NaN                     NaN
196         197    NaN   NaN                 NaN                     NaN
197         198    NaN   NaN                 NaN                     NaN
198         199    NaN   NaN                 NaN                     NaN
199         200    NaN   NaN                 NaN                     NaN

[200 rows x 5 columns]

In [25]:
df.loc[:,'Age'].mode()

0    32
Name: Age, dtype: int64

In [26]:
df.mode(axis=1)[0:4]

     0     1     2     3
0  1.0  15.0  19.0  39.0
1  2.0  15.0  21.0  81.0
2  3.0   6.0  16.0  20.0
3  4.0  16.0  23.0  77.0

In [27]:
df.min()

CustomerID                 1.0
Genre                      NaN
Age                       18.0
Annual Income (k$)        15.0
Spending Score (1-100)     1.0
dtype: float64

In [28]:
df.max()

CustomerID                200.0
Genre                       NaN
Age                        70.0
Annual Income (k$)        137.0
Spending Score (1-100)     99.0
dtype: float64

In [29]:
df.loc[:,'Age'].max(skipna = False)

70

In [30]:
df.std()

CustomerID                57.879185
Genre                           NaN
Age                       13.969007
Annual Income (k$)        26.264721
Spending Score (1-100)    25.823522
dtype: float64

In [31]:
df.loc[:,'Age'].std()

13.96900733155888

In [32]:
df.std(axis=1)[0:4]

0    15.695010
1    35.074920
2     8.057088
3    32.300671
dtype: float64

In [33]:
df.groupby(['Genre'])['Age'].mean()

Series([], Name: Age, dtype: float64)

In [34]:
df_u=df.rename(columns= {'Annual Income (k$)':'Income'},inplace=False)
df_u.groupby(['Genre']).Income.mean()

Series([], Name: Income, dtype: float64)

In [35]:
from sklearn import preprocessing
one_hot_encoder = preprocessing.OneHotEncoder()
enc_df = pd.DataFrame(one_hot_encoder.fit_transform(df[['Genre']]).toarray())
enc_df

       0
0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
..   ...
195  1.0
196  1.0
197  1.0
198  1.0
199  1.0

[200 rows x 1 columns]

In [36]:
df_encode =df_u.join(enc_df)
df_encode

     CustomerID  Genre  Age  Income  Spending Score (1-100)    0
0             1    NaN   19      15                      39  1.0
1             2    NaN   21      15                      81  1.0
2             3    NaN   20      16                       6  1.0
3             4    NaN   23      16                      77  1.0
4             5    NaN   31      17                      40  1.0
..          ...    ...  ...     ...                     ...  ...
195         196    NaN   35     120                      79  1.0
196         197    NaN   45     126                      28  1.0
197         198    NaN   32     126                      74  1.0
198         199    NaN   32     137                      18  1.0
199         200    NaN   30     137                      83  1.0

[200 rows x 6 columns]

In [37]:
iris = pd.read_csv("data33.csv")
iris

,Sepal Length,Sepal Width,Petal Length,Petal Width,Species,Other
0,5.1,3.5,1.4,0.2,Iris-setosa,1
1,4.9,3.0,1.4,0.2,Iris-setosa,2
2,4.7,3.2,1.3,0.2,Iris-setosa,3
3,4.6,3.1,1.5,0.2,Iris-setosa,4
4,5.0,3.6,1.4,0.2,Iris-setosa,5
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,Iris-virginica,146
146,6.3,2.5,5.0,1.9,Iris-virginica,147
147,6.5,3.0,5.2,2.0,Iris-virginica,148
148,6.2,3.4,5.4,2.3,Iris-virginica,149
149,5.9,3.0,5.1,1.8,Iris-virginica,150

In [38]:
irisSet = (iris['Species']== 'Iris-setosa')

In [39]:
print('Iris-setosa')

Iris-setosa

In [40]:
iris[irisSet].describe()

       Sepal Length  Sepal Width  Petal Length  Petal Width     Other
count      50.00000    50.000000     50.000000     50.00000  50.00000
mean        5.00600     3.418000      1.464000      0.24400  25.50000
std         0.35249     0.381024      0.173511      0.10721  14.57738
min         4.30000     2.300000      1.000000      0.10000   1.00000
25%         4.80000     3.125000      1.400000      0.20000  13.25000
50%         5.00000     3.400000      1.500000      0.20000  25.50000
75%         5.20000     3.675000      1.575000      0.30000  37.75000
max         5.80000     4.400000      1.900000      0.60000  50.00000

In [41]:
irisVer = (iris['Species']== 'Iris-versicolor')

In [42]:
print('Iris-versicolor')
iris[irisVer].describe()

Iris-versicolor

       Sepal Length  Sepal Width  Petal Length  Petal Width      Other
count     50.000000    50.000000     50.000000    50.000000   50.00000
mean       5.936000     2.770000      4.260000     1.326000   75.50000
std        0.516171     0.313798      0.469911     0.197753   14.57738
min        4.900000     2.000000      3.000000     1.000000   51.00000
25%        5.600000     2.525000      4.000000     1.200000   63.25000
50%        5.900000     2.800000      4.350000     1.300000   75.50000
75%        6.300000     3.000000      4.600000     1.500000   87.75000
max        7.000000     3.400000      5.100000     1.800000  100.00000

In [43]:
irisVir = (iris['Species']== 'Iris-virginica')

In [44]:
print('Iris-virginica')
print(iris[irisVir].describe())

Iris-virginica
       Sepal Length  Sepal Width  Petal Length  Petal Width      Other
count      50.00000    50.000000     50.000000     50.00000   50.00000
mean        6.58800     2.974000      5.552000      2.02600  125.50000
std         0.63588     0.322497      0.551895      0.27465   14.57738
min         4.90000     2.200000      4.500000      1.40000  101.00000
25%         6.22500     2.800000      5.100000      1.80000  113.25000
50%         6.50000     3.000000      5.550000      2.00000  125.50000
75%         6.90000     3.175000      5.875000      2.30000  137.75000
max         7.90000     3.800000      6.900000      2.50000  150.00000